Revit 2027 API
FabricationPart.GetHostedInfo Method
 Gets the fabrication hosted element information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationHostedInfo GetHostedInfo()
Public Function GetHostedInfo As FabricationHostedInfo
public:
FabricationHostedInfo^ GetHostedInfo()
member GetHostedInfo : unit -> FabricationHostedInfo
Return Value
FabricationHostedInfo
 The fabrication hosted element information. Returns null if the fabrication part does not have a host.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace